biddr_api/app/models/user.rb

SELECT 1 AS one FROM "users" WHERE "users"."api_key" = $1 LIMIT $2  [["api_key", "4aa6ad6ff282fdcf70485bb06e938f30f00b2a78b3d7000d16dfcac6c70fd2fd"], ["LIMIT", 1]]
---
  def generate_api_key
    loop do
      self.api_key = SecureRandom.hex(32)
      break unless User.exists?(api_key: api_key)